32 116
32 97
104 101
105 110
114 101
256 258
32 111
101 114
111 110
97 116
32 115
101 110
32 99
32 119
101 115
105 115
110 100
111 114
105 116
32 112
101 100
97 108
262 102
32 98
32 102
97 110
32 259
97 114
259 103
32 109
111 117
257 272
105 99
256 111
105 264
32 100
108 101
114 111
97 115
32 104
267 116
256 104
99 116
105 108
32 101
32 260
111 109
32 108
32 110
118 101
115 116
108 121
279 101
32 84
32 271
111 108
115 101
265 290
32 103
105 100
105 109
99 101
32 65
117 116
101 116
111 116
117 114
114 97
99 104
32 83
280 273
111 119
226 128
105 103
32 67
297 265
262 110
32 117
118 263
32 73
105 114
266 116
97 109
117 108
97 121
97 100
101 108
257 115
274 104
258 114
275 293
268 264
32 121
32 77
257 110
32 49
269 344
269 104
262 114
257 260
32 40
116 263
105 102
32 274
32 80
309 258
257 108
111 100
109 296
271 116
116 104
263 115
111 112
103 101
265 101
32 66
291 101
105 270
299 108
101 260
117 115
117 109
32 72
300 120
97 98
260 115
32 258
268 302
101 298
279 121
274 121
270 116
270 115
348 286
293 109
111 260
111 115
114 105
108 100
266 117
295 97
101 109
257 116
269 294
97 99
32 87
105 305
110 116
32 118
32 68
113 117
97 259
112 112
329 104
32 69
32 82
281 116
117 100
280 390
107 101
32 70
97 272
32 50
111 99
32 78
105 118
268 104
304 101
266 101
273 116
32 114
32 71
117 110
117 260
304 321
283 116
288 277
48 48
32 76
105 277
268 281
396 305
111 103
32 292
266 104
266 112
32 267
328 153
409 116
288 104
277 108
84 258
112 116
297 271
114 286
257 98
116 345
286 394
39 115
103 104
111 306
286 114
290 115
269 273
283 100
265 276
302 101
117 306
32 74
101 283
32 328
259 101
342 108
286 116
32 79
105 97
112 263
269 101
281 115
294 116
32 85
333 115
102 102
261 336
282 116
97 298
101 99
32 316
275 108
112 108
353 445
335 110
100 117
101 119
32 34
286 115
32 107
97 103
315 101
97 369
97 260
347 116
362 108
105 122
269 258
97 107
291 271
105 98
261 121
267 100
99 99
257 100
283 121
351 57
264 103
97 112
114 117
313 115
265 263
273 109
269 375
295 294
305 108
285 391
282 99
339 116
105 112
111 363
383 112
301 115
269 374
279 319
105 260
262 452
291 111
267 317
275 263
117 277
268 108
115 111
114 121
299 100
309 104
332 101
101 112
285 281
111 107
380 292
111 312
328 157
281 317
259 100
285 101
32 106
257 114
329 110
400 107
295 271
294 115
296 115
97 324
98 263
97 317
381 115
298 290
333 110
288 101
338 101
273 100
260 265
275 431
294 101
325 116
97 118
41 46
353 111
273 121
286 403
256 101
257 408
362 535
97 117
300 118
389 114
271 104
97 415
383 109
483 112
32 75
266 111
274 290
117 98
311 438
262 319
275 260
451 469
316 101
99 105
267 115
264 101
334 121
282 102
286 272
274 101
337 413
273 115
260 101
466 156
105 281
109 263
99 270
275 101
348 465
266 121
330 104
117 101
297 281
333 112
285 340
308 267
32 86
105 292
107 115
281 103
265 270
114 288
359 115
261 109
301 99
111 542
295 341
110 327
105 101
266 462
308 99
108 327
257 103
314 111
334 115
261 260
340 115
97 299
32 406
335 116
272 263
105 415
264 115
112 104
286 455
480 111
263 118
114 274
357 110
368 292
256 323
264 100
32 51
358 102
256 119
266 97
116 101
284 115
450 455
108 288
500 110
109 115
260 110
32 323
261 312
108 413
313 277
269 453
336 306
418 433
423 119
262 334
111 305
292 298
301 112
106 384
259 116
282 100
256 592
459 107
268 311
314 267
347 115
277 307
291 270
111 98
257 298
32 45
279 108
258 100
358 288
32 293
108 108
333 640
285 456
364 115
607 649
260 100
119 110
274 373
538 271
121 115
306 397
308 116
119 101
518 368
333 312
577 312
476 110
301 108
418 48
492 627
395 324
257 506
32 89
41 44
291 653
295 327
304 111
271 115
350 121
32 358
346 118
265 402
108 270
256 114
280 668
520 665
278 102
99 276
332 307
110 284
654 111
112 292
111 118
105 491
339 283
262 322
478 384
441 482
303 641
422 537
257 109
275 104
111 311
263 109
393 98
477 276
301 103
105 276
277 366
116 115
102 357
378 101
372 705
297 658
346 488
392 115
541 121
379 112
266 322
275 111
262 98
423 276
99 388
117 99
353 265
110 101
257 99
265 104
398 116
265 284
300 109
322 284
609 702
288 115
105 320
97 119
327 263
283 324
266 99
450 272
258 110
121 112
277 115
271 101
608 115
293 112
259 107
32 52
263 116
311 100
321 104
283 107
372 99
269 514
605 288
358 101
312 108
319 290
116 267
274 276
503 292
343 115
323 109
102 339
341 101
299 386
395 98
294 276
275 114
327 110
507 100
588 121
365 115
99 121
103 281
293 119
73 110
282 118
281 369
351 56
46 46
395 408
704 267
275 311
117 381
301 109
108 112
102 391
282 357
268 453
280 101
375 100
315 296
275 381
440 453
268 111
32 53
98 292
280 108
320 104
110 103
117 324
318 115
382 828
288 107
102 515
703 824
500 260
716 375
318 796
301 312
102 116
655 315
105 634
258 115
299 121
334 110
271 109
274 115
324 110
323 298
268 573
304 377
300 283
259 115
268 296
266 109
269 468
324 744
725 474
288 116
101 120
264 116
280 598
326 109
101 334
322 277
103 121
710 49
275 367
322 110
303 283
46 34
108 417
412 115
597 515
379 338
285 363
295 409
274 116
268 446
295 377
285 276
275 587
118 276
302 109
265 429
533 307
257 752
549 463
297 544
303 510
282 306
317 448
99 263
321 345
111 121
291 320
32 276
32 345
360 293
259 270
279 117
285 581
578 267
99 296
459 394
101 102
263 277
303 419
261 110
301 102
502 99
105 489
426 444
291 365
379 116
294 270
450 112
432 307
118 296
372 102
300 738
314 320
273 107
84 104
583 425
266 551
630 707
346 103
32 596
382 750
887 313
100 115
269 340
424 101
318 108
108 276
266 316
280 311
308 284
49 57
119 460
266 563
525 112
275 265
582 428
99 107
421 270
268 283
520 260
316 270
424 99
105 111
401 104
280 481
117 270
266 593
566 288
379 472
103 320
268 97
501 284
336 264
285 264
285 843
124 124
268 468
285 806
283 109
265 345
114 281
512 298
110 388
280 338
32 54
285 121
574 861
116 258
850 403
265 97
741 662
855 386
291 773
314 323
120 116
300 556
300 596
499 276
337 370
420 489
466 147
266 320
293 115
103 103
632 407
32 415
416 273
99 264
257 319
633 858
550 116
262 698
318 110
283 115
493 270
32 296
301 406
404 283
259 317
525 521
273 110
256 783
117 272
285 397
281 121
266 258
279 552
442 100
302 267
384 290
318 114
411 101
303 797
275 368
361 121
372 112
268 260
118 267
258 109
433 48
314 930
295 316
951 631
266 419
346 764
401 101
116 121
259 276
600 121
46 545
528 298
322 121
439 283
271 689
440 327
104 522
268 322
439 518
439 341
335 272
530 270
118 975
266 870
363 121
39 116
304 327
295 365
499 101
282 115
285 259
277 101
97 104
256 387
111 104
319 101
301 341
116 284
524 292
275 778
259 277
44 34
279 792
280 547
509 57
262 506
293 108
263 879
97 120
32 55
308 829
868 446
938 412
105 296
114 264
881 264
105 342
346 839
256 565
266 107
105 120
257 118
46 44
114 277
325 101
260 341
325 112
110 317
288 270
297 602
335 102
722 315
600 555
291 315
314 523
337 114
435 307
345 115
379 485
99 108
864 557
266 263
674 425
1064 364
502 101
278 800
335 115
100 263
118 284
354 816
351 48
357 115
291 811
118 270
346 116
316 370
308 108
117 112
303 417
259 313
303 388
275 757
300 673
852 779
303 625
422 283
404 271
314 108
893 281
306 274
497 259
421 315
274 277
97 336
477 284
371 319
32 387
496 100
883 369
339 313
798 102
892 276
280 523
328 148
97 305
105 263
266 646
97 106
260 403
268 457
285 463
291 992
273 366
353 617
378 327
888 733
895 659
407 115
291 340
292 283
301 116
419 107
484 281
103 267
32 56
114 284
98 367
339 108
314 565
285 407
761 676
306 417
684 551
105 273
280 428
1012 364
396 272
286 366
100 340
256 581
266 311
303 777
100 586
286 110
582 264
285 320
116 264
851 281
426 271
376 115
392 276
686 421
347 102
105 474
708 994
294 104
404 277
32 57
405 101
286 312
534 554
277 386
501 270
823 425
727 284
257 781
314 817
103 263
681 263
297 644
105 406
105 334
318 272
776 121
262 112
682 315
1010 302
1005 115
274 458
301 488
269 647
109 281
937 271
99 302
260 267
266 302
100 101
119 340
481 263
498 327
87 104
338 112
105 377
279 1066
291 1053
330 264
300 406
719 290
375 306
711 110
507 118
268 273
337 374
419 105
337 417
49 48
116 276
267 312
374 290
116 111
285 265
279 625
457 606
50 48
290 277
114 271
484 558
532 917
352 469
528 100
101 103
279 111
270 112
1007 306
910 765
684 99
337 431
266 108
114 373
514 435
280 489
323 643
297 788
350 907
105 363
330 897
285 444
256 397
442 1089
638 387
268 511
575 293
268 496
269 1031
314 117
743 701
421 284
372 109
442 1125
439 103
44 545
384 276
422 619
114 365
114 313
499 313
564 284
308 104
111 315
110 263
310 115
285 299
790 407
266 636
708 801
355 97
835 296
1169 273
421 267
422 820
97 122
330 311
108 1056
259 284
103 259
358 749
260 116
265 878
342 115
32 494
318 116
497 1088
407 276
1126 567
117 312
754 364
275 862
496 403
969 296
117 103
480 1260
101 101
285 283
360 104
32 39
1138 628
257 336
294 264
108 580
352 259
265 116
105 267
321 101
506 388
274 402
328 147
361 260
328 156
361 312
108 388
588 432
258 260
300 1238
1153 533
269 283
423 283
756 298
275 554
263 110
300 478
104 273
448 290
973 376
293 488
285 1291
265 115
279 294
914 537
350 116
421 276
693 1193
109 101
351 53
98 115
266 340
279 293
32 38
283 99
301 306
1098 100
263 284
346 675
110 276
941 804
115 121
262 472
330 281
318 100
865 307
300 294
979 115
265 273
739 373
108 467
32 834
483 109
263 99
275 283
296 435
568 620
32 305
111 102
259 97
727 101
424 334
338 270
1087 322
442 103
115 112
320 115
32 91
296 307
1046 435
427 363
688 523
438 1293
302 115
303 475
410 842
420 666
267 103
970 736
275 322
303 444
762 675
285 1329
411 270
262 408
300 292
350 316
354 329
279 260
841 363
392 112
269 412
825 274
964 651
677 1375
303 327
619 117
323 112
265 288
1059 1170
346 102
986 857
891 292
281 107
256 393
303 316
323 259
262 394
380 807
119 119
548 294
921 277
457 317
99 284
73 116
819 311
333 403
460 115
275 392
285 672
277 107
1069 572
346 112
714 286
372 118
347 306
268 521
330 108
354 1129
722 494
1103 637
863 536
291 264
296 290
315 115
366 644
295 462
315 531
101 341
630 462
275 559
822 46
325 104
271 290
1426 277
300 116
304 563
273 373
256 263
279 336
105 107
358 121
410 110
103 110
101 276
303 514
280 457
275 321
49 50
381 296
266 274
346 472
259 99
266 1021
280 391
32 90
330 296
118 925
302 112
382 260
285 267
1100 364
279 267
346 109
351 55
648 666
289 112
410 120
505 276
1236 267
285 376
812 586
279 105
289 111
380 273
256 260
105 555
404 925
532 847
49 56
610 1315
466 148
1210 107
548 474
280 283
311 799
300 108
103 276
275 393
401 782
275 456
1176 877
274 263
119 496
102 558
280 260
355 294
285 793
117 787
336 99
485 270
32 81
742 510
256 963
1143 802
1076 110
108 117
609 109
280 259
112 283
116 116
395 1365
484 340
268 1324
380 307
101 107
583 293
1495 543
285 1454
532 1296
349 276
909 745
279 387
426 428
428 101
318 102
292 121
350 277
703 357
268 258
301 317
304 264
295 329
509 56
1045 284
655 102
485 908
301 277
274 345
119 636
275 319
360 108
1008 540
280 602
351 50
529 115
663 100
1573 101
105 531
291 342
976 366
867 1054
337 984
470 110
259 388
111 676
117 403
111 292
296 277
451 292
548 281
413 101
268 567
275 407
292 116
112 273
325 593
280 400
309 111
121 109
713 388
268 707
110 321
49 49
762 115
303 365
299 283
314 1330
410 283
1006 387
322 452
303 1467
279 809
114 315
271 276
436 906
268 456
288 292
374 115
304 1339
505 115
257 738
347 100
303 1461
424 397
265 572
320 288
115 119
1481 299
111 334
391 100
396 408
939 690
382 341
429 100
351 54
624 564
501 267
575 465
524 319
119 936
256 882
297 657
108 263
32 46
268 1181
1099 661
32 36
1011 1382
395 1654
108 284
841 284
101 98
50 433
440 425
49 53
484 412
285 1270
315 100
685 277
277 102
370 307
476 83
112 114
266 284
371 647
441 558
1600 621
98 101
590 932
109 557
32 322
470 114
368 101
34 46
439 116
410 1622
97 316
301 292
383 101
464 489
419 117
112 384
372 769
742 573
273 394
271 99
318 692
45 45
803 1265
425 115
401 283
438 110
464 1580
347 110
102 273
383 98
315 270
511 115
274 273
1060 115
1036 1161
117 276
32 48
281 606
1196 560
65 115
257 369
439 853
1299 472
1287 746
97 472
264 270
277 270
451 672
285 321
265 601
288 313
114 370
949 369
1537 919
118 735
268 1041
428 103
1099 109
852 1399
280 299
295 460
509 55
105 338
1247 1696
268 929
32 263
97 408
110 277
342 102
379 365
368 104
728 288
739 435
717 877
32 374
268 277
439 475
267 110
280 631
674 1524
677 463
109 259
382 431
630 563
1158 380
958 386
267 606
477 899
291 323
266 119
266 599
397 557
512 103
419 376
774 115
375 1109
989 813
98 121
275 475
363 101
420 1174
279 376
371 101
291 636
294 357
314 260
319 429
819 387
288 521
268 1574
1024 101
1026 1188
87 101
268 647
285 521
926 115
114 316
304 515
292 364
389 842
1457 432
362 510
404 311
111 321
575 659
285 493
1286 313
53 48
302 281
323 121
459 945
291 114
466 152
423 334
51 48
111 120
351 52
111 341
256 512
1171 312
119 104
505 284
256 745
427 267
417 115
1147 1250
863 1290
798 1135
291 393
681 920
740 307
266 494
73 102
298 273
425 428
423 764
423 997
325 99
325 419
308 1336
109 456
275 1349
289 972
1314 270
1874 345
114 444
511 101
407 284
265 324
760 1569
1667 1240
291 611
512 560
687 45
309 101
739 690
281 101
595 121
1677 412
83 116
336 100
396 1130
78 65
343 107
1055 731
105 408
404 336
118 277
258 116
271 264
457 115
115 99
421 299
966 265
492 547
714 936
482 1118
314 114
950 1651
559 290
442 99
688 552
349 340
402 307
285 974
321 115
304 320
1022 115
1252 265
299 699
289 1200
285 734
680 292
1080 656
257 1249
956 642
427 111
431 364
115 264
459 618
652 48
810 316
103 270
325 111
371 108
427 745
422 111
281 99
484 400
65 110
1668 495
746 319
95 95
405 540
320 263
1043 115
276 105
1653 366
465 324
924 1211
1284 1908
268 386
291 338
321 116
600 373
294 284
121 100
434 101
442 644
99 292
304 666
32 122
314 402
405 114
447 260
574 400
1465 388
509 54
583 481
957 1551
1406 324
470 767
1117 510
105 381
411 540
1055 110
280 1818
274 284
299 116
280 1805
349 283
266 377
280 402
401 1730
365 288
478 288
716 1820
314 781
49 51
300 121
969 531
587 659
1319 569
97 102
303 778
495 364
484 886
1182 882
538 265
268 565
613 264
832 342
267 815
338 259
303 97
851 97
1607 345
276 920
808 675
362 1614
377 112
280 1025
302 270
105 313
280 1189
962 567
330 277
1020 735
114 461
260 108
1232 101
318 98
934 115
1770 1119
768 1239
46 41
323 661
280 1655
578 1502
112 425
260 338
325 462
359 1162
338 109
424 267
459 100
488 298
303 467
426 982
280 580
70 273
743 321
754 276
534 544
711 1764
117 292
366 284
427 101
500 452
1107 121
597 1581
457 1779
49 55
680 673
1136 384
844 115
99 856
32 1952
825 288
346 98
503 807
677 288
115 494
1709 292
306 263
325 121
300 1613
424 120
568 370
350 110
378 271
763 115
525 1274
353 121
679 284
894 432
114 874
256 1682
256 536
320 963
97 101
280 1401
318 298
880 50
1019 528
262 299
633 284
1505 429
325 1199
569 270
1039 370
115 104
646 313
1301 290
709 513
32 88
339 270
65 83
268 563
492 374
772 1611
303 402
337 540
281 110
330 283
32 388
291 1726
400 121
672 697
277 116
303 757
574 338
104 284
578 296
280 446
273 103
621 116
97 448
274 508
291 387
353 599
274 1636
41 58
279 1471
280 637
623 1859
1237 263
266 296
269 636
682 377
104 503
303 340
318 109
371 121
301 100
713 1318
347 906
548 320
701 271
322 324
362 2051
291 1804
295 1705
337 265
49 52
293 692
311 108
812 559
301 1359
1585 112
32 393
1151 1077
105 311
895 1334
970 522
303 1308
47 47
308 631
1069 273
117 342
423 103
971 1623
295 1221
285 288
301 485
275 340
289 954
262 448
1231 116
69 82
291 471
880 48
1307 432
274 270
288 513
111 557
690 313
260 103
293 698
269 114
109 121
318 463
332 317
540 505
97 319
295 791
337 620
574 997
346 656
753 750
351 51
392 271
691 292
889 342
266 1477
270 99
395 110
301 683
444 115
266 594
291 595
891 276
282 274
1101 259
289 311
748 290
195 169
267 276
301 481
401 344
102 263
103 387
372 103
319 270
571 292
709 329
265 826
285 554
378 365
283 284
1213 386
108 273
291 105
108 641
577 455
650 1204
889 1380
1149 1704
308 816
550 103
58 2158
324 628
556 284
1440 1360
534 1722
1008 121
436 1647
503 114
1451 784
307 284
713 573
289 542
289 116
448 1438
986 299
1350 814
334 495
426 820
335 73
1080 120
1237 833
32 124
393 101
269 494
393 276
451 115
756 560
285 547
322 386
360 381
347 905
424 1584
1374 288
370 103
624 1737
534 1137
590 100
1039 461
260 1393
339 513
268 368
109 112
962 809
1228 366
1018 528
1362 292
264 306
1378 115
110 338
351 49
763 276
1767 432
1113 270
593 296
337 572
336 109
566 115
1213 699
1019 1281
269 547
305 260
350 1672
285 1224
102 481
285 1889
624 296
65 108
268 121
103 111
522 292
268 114
270 648
288 467
349 259
266 1780
32 634
1024 270
1570 406
421 386
99 299
493 276
1684 263
294 107
266 1102
1301 458
1563 118
285 273
1429 467
279 329
709 461
99 689
291 302
770 552
266 1070
564 263
1013 1662
1310 277
1522 1420
98 264
286 323
1703 292
268 1253
280 329
323 100
362 1872
511 281
72 327
1218 611
658 116
480 1385
268 292
304 898
585 853
256 468
909 637
49 54
351 433
473 1590
377 101
709 723
1151 799
1813 1629
109 98
330 111
360 101
380 274
67 104
1408 341
348 320
422 446
117 313
1448 1950
1710 580
271 357
276 115
1322 968
1649 646
395 472
686 899
1113 276
397 448
418 53
275 425
284 1208
600 296
316 296
263 121
598 115
268 319
260 298
838 48
111 264
269 259
380 724
427 117
32 334
377 98
324 281
392 270
1057 115
840 117
275 495
420 111
1754 898
312 406
330 1533
1945 1929
1531 263
265 960
266 1269
105 376
275 1756
568 413
830 481
1341 97
808 306
1591 305
880 49
865 366
426 370
305 121
325 258
767 121
320 121
1625 115
314 101
760 118
311 288
1386 115
257 2233
376 104
507 521
748 460
97 105
368 115
112 315
421 277
393 448
395 260
330 874
303 788
325 482
941 2028
1096 288
1793 365
756 317
1241 317
87 782
257 560
872 290
265 357
314 1246
322 115
768 905
1348 562
1389 284
112 307
765 107
1168 562
291 421
341 397
550 324
1582 2245
261 1462
268 274
1191 116
1641 531
84 111
111 270
1829 277
372 98
1266 460
112 319
303 276
303 1567
291 329
464 2337
624 897
69 83
32 47
263 305
594 402
669 56
323 853
1850 101
318 752
1004 116
464 117
522 115
1734 461
103 284
384 458
259 508
268 1205
914 1980
266 338
268 101
300 334
1867 508
376 290
590 1766
1065 115
347 2038
279 283
300 605
337 393
269 537
326 317
314 294
330 273
956 384
263 491
280 393
680 273
1449 1866
2244 277
292 120
1124 276
648 277
2096 1058
338 98
650 1335
1475 429
1873 115
303 380
309 114
1194 276
280 265
297 565
873 116
903 263
441 101
1627 429
405 569
1103 1320
1817 514
108 316
289 698
347 1204
393 277
109 264
39 260
400 99
1452 259
680 108
755 469
1452 1082
1514 366
267 101
382 569
638 846
66 319
109 97
112 293
301 118
349 281
506 1318
283 857
108 373
442 115
464 281
950 733
108 116
110 489
259 111
499 284
411 320
291 776
662 324
628 102
117 508
303 321
392 586
451 807
1137 307
122 101
32 336
283 373
73 68
329 313
487 2153
1392 284
103 804
488 99
787 393
323 272
497 481
1247 2081
1444 112
1783 435
266 406
805 307
1322 611
1384 276
410 100
268 1904
330 642
256 974
280 981
473 444
957 648
100 302
257 478
400 689
584 284
112 115
349 779
282 1540
395 478
319 458
638 1223
1513 661
404 2154
114 273
894 471
295 1902
294 99
650 518
548 2389
1242 800
279 1187
327 115
1572 320
2018 358
541 1997
669 57
97 478
121 108
295 2151
509 52
341 270
1148 274
325 870
79 110
256 1090
360 559
379 1418
497 407
487 1540
1036 736
99 258
271 284
365 546
267 284
292 540
934 402
50 49
275 1972
360 431
497 296
259 618
303 370
669 55
1303 556
326 661
338 276
337 368
383 270
1272 357
1459 115
73 83
110 606
288 724
401 387
1602 2140
2172 1518
98 809
347 99
772 98
265 367
111 381
440 811
1443 307
477 270
304 765
263 313
358 116
1480 896
1918 1685
378 283
404 274
770 2372
962 1957
330 573
372 540
275 769
303 111
104 523
279 322
282 106
923 263
950 2448
32 319
416 983
2061 1589
89 286
275 872
549 413
621 521
1023 471
1230 683
578 555
303 1549
349 376
266 1274
441 1107
756 729
1217 2375
1025 697
1323 2120
532 109
549 685
864 1188
1632 99
973 448
266 265
1635 284
1708 299
79 78
261 572
280 2009
493 284
559 276
1483 586
677 2185
1381 288
1576 117
264 312
298 458
1712 281
2108 364
104 1743
589 2064
754 284
117 107
569 284
1350 690
1994 1195
360 263
1346 377
280 558
382 394
1168 1110
50 53
411 1233
108 444
303 438
105 323
280 528
304 1174
336 274
424 97
280 97
1123 373
2261 834
418 52
107 627
317 281
2183 1105
297 284
746 799
110 367
32 120
632 111
885 115
1484 364
1388 288
65 82
318 1351
297 491
383 485
404 494
1097 277
56 48
297 376
953 57
1510 99
65 84
108 338
266 631
345 110
967 601
971 1363
260 119
270 101
401 374
257 2248
318 408
847 313
1442 366
291 286
452 110
480 1282
727 270
789 48
827 734
280 2078
312 101
317 276
392 429
1474 119
101 277
830 112
280 397
349 391
353 544
958 699
379 99
1171 116
2615 2691
285 388
360 114
382 265
101 118
256 1485
281 815
328 166
380 320
464 1599
2254 896
299 292
347 917
680 264
416 2560
1796 1334
119 1373
280 617
1725 580
73 78
303 552
1061 367
110 97
292 567
362 1500
482 707
1123 735
1792 536
323 342
966 617
281 97
524 1027
564 367
325 117
1357 305
111 307
114 475
304 313
648 320
256 283
315 276
319 104
1152 611
1309 2278
271 661
360 283
505 263
610 1424
1106 448
301 1532
339 370
867 1105
1020 1235
98 273
110 115
257 112
318 403
335 403
401 2699
109 284
295 456
400 856
679 367
483 495
502 112
770 1498
349 101
616 277
111 460
2456 499
2479 307
582 417
832 320
932 290
111 596
281 729
1062 604
1242 284
99 373
295 2700
425 2772
635 829
104 791
276 471
304 319
1437 121
1453 501
110 270
266 286
269 296
297 1892
303 960
335 109
395 306
961 2330
1144 621
1555 604
524 281
727 276
761 273
904 1503
1491 429
408 263
262 120
285 573
610 283
928 2270
1610 101
41 59
97 339
367 264
316 377
377 281
492 284
117 369
530 1865
108 797
672 1715
686 402
1451 277
365 775
378 263
428 324
803 388
1323 270
1377 307
317 692
719 458
2558 2811
266 1032
332 1415
637 121
682 365
825 108
1078 284
318 99
362 648
365 536
1273 115
2060 121
32 194
317 1715
1158 316
280 339
410 2575
1417 1948
473 1395
1020 105
111 273
263 103
299 392
303 672
590 112
681 1671
1384 270
285 374
285 907
1545 288
302 98
933 259
109 1455
339 461
1669 115
266 1199
662 103
1302 1154
387 288
748 736
268 1239
330 510
812 276
832 276
268 265
279 114
309 323
338 97
1593 115
1610 2415
1928 858
99 1076
304 444
585 299
638 599
1185 815
269 446
893 474
923 673
1203 115
34 44
274 313
357 109
1075 115
1397 341
2344 1568
440 496
583 1830
330 258
257 306
318 103
318 2709
1800 119
335 83
349 1027
371 283
524 320
266 376
1967 1119
339 115
295 2357
1046 1235
1319 547
2342 281
303 456
279 339
50 50
79 82
98 625
112 101
275 552
1101 1663
2246 373
65 272
256 322
337 101
360 260
610 537
291 438
424 779
470 298
1152 1747
1604 959
1546 277
1933 508
1128 2829
300 1006
1871 731
590 99
65 78
117 2295
354 100
372 277
376 276
575 2576
904 274
121 651
271 270
468 284
651 264
1605 1391
121 284
524 1159
883 1229
1483 1366
103 781
54 48
271 108
325 109
119 785
108 749
670 115
943 121
1228 284
292 560
300 99
588 373
1470 801
1755 276
2057 1265
279 2340
794 108
256 1224
285 556
530 284
279 380
283 114
616 311
1912 2331
497 1179
549 111
1721 281
2220 572
121 292
271 458
280 569
411 1211
424 673
2552 2562
1256 307
2760 463
259 432
279 1250
302 320
342 116
349 456
360 311
561 99
956 2719
1553 546
1596 467
1954 495
300 265
483 485
810 676
32 61
1529 306
104 338
288 97
72 101
73 84
269 981
295 273
337 2965
1126 929
1870 1235
434 777
1416 1516
2165 293
2190 259
285 315
50 52
114 620
594 290
976 1744
111 101
288 461
1202 283
274 656
280 804
301 305
393 1383
590 1518
616 336
266 598
285 2705
1044 1162
404 374
322 373
957 1095
257 413
1288 276
1836 313
2849 1803
440 446
837 334
269 523
280 2161
1843 788
2980 311
103 283
32 44
256 719
426 469
1146 284
325 324
1341 294
299 270
411 482
524 264
879 448
1063 110
120 288
424 2292
1071 494
259 370
268 463
291 267
392 284
427 108
427 602
669 54
1837 110
1983 605
349 99
424 1359
1411 121
2227 277
326 605
326 606
650 1248
2317 370
111 415
266 299
468 327
1311 277
256 602
295 1958
379 905
935 1079
1220 2942
114 115
300 444
314 321
418 49
492 1499
1937 281
80 65
441 1519
507 368
823 307
346 729
871 2031
883 2213
2359 97
79 767
669 53
880 51
1062 471
1765 860
476 78
768 315
2840 972
374 276
397 115
32 10
276 302
330 1205
360 793
502 485
1898 376
108 1167
424 406
470 452
578 1560
266 277
279 1023
948 1500
1900 288
97 315
295 783
420 101
585 264
772 321
372 341
507 2436
871 109
256 505
283 105
1026 572
1192 115
1525 270
280 512
293 656
632 602
827 407
837 475
541 3039
1263 2381
279 277
293 302
420 2918
782 115
315 263
851 474
2525 315
99 2475
325 646
867 263
1381 1735
282 110
350 2285
52 48
266 2636
416 1697
633 277
363 373
73 67
291 263
312 116
691 341
259 298
279 567
410 3159
446 276
1388 271
300 112
311 270
400 270
464 270
1061 284
1106 101
1526 1049
2239 508
314 563
398 2961
434 3048
1563 273
65 116
117 491
268 460
332 270
418 51
669 48
108 115
264 121
289 394
312 99
487 99
2898 373
32 562
318 842
464 2053
279 274
578 277
1072 2215
50 51
119 514
291 619
470 98
1136 1032
268 286
663 260
50 54
98 274
119 111
266 791
279 1955
291 793
477 263
550 393
100 267
279 1270
293 1185
330 386
1198 115
73 86
275 112
850 1109
928 323
1712 97
55 48
281 618
109 276
116 373
292 98
294 642
1411 857
624 1433
921 461
2181 599
32 105
291 749
337 323
405 111
891 284
961 536
1184 320
314 460
404 872
1229 121
1309 417
1561 312
2542 307
114 546
296 104
1232 270
1446 115
50 57
291 2932
303 2781
416 668
3127 101
265 322
283 604
835 834
2293 263
280 1835
315 555
323 103
404 321
1658 369
2052 531
268 744
268 1811
399 656
401 514
1886 861
1895 276
2809 270
285 277
288 111
302 284
303 358
312 298
349 264
762 116
964 2260
2870 594
260 306
275 267
285 302
295 981
499 513
280 982
794 260
256 274
302 97
303 913
2121 293
2162 723
102 384
268 1023
300 366
2523 501
337 512
561 2022
610 2141
1725 115
258 341
1098 945
1514 945
66 121
827 1179
1422 972
1796 1360
65 76
256 267
279 1468
987 48
1128 2770
1450 695
2361 1442
304 2647
334 312
473 98
308 3045
419 114
487 357
1019 1975
1251 115
2067 702
2675 121
2777 1774
330 457
405 1894
588 365
941 559
101 618
337 559
475 288
1940 270
1991 101
99 618
280 444
363 270
420 321
426 2047
1038 505
2894 407
257 1568
410 475
108 259
441 2742
2217 735
681 270
958 1762
1155 115
1390 105
996 488
1033 116
1455 1154
105 813
118 387
295 321
410 109
728 263
83 111
258 108
295 283
381 104
483 1017
507 106
794 1508
1428 115
1826 2301
121 366
411 276
760 781
2143 115
3216 2311
268 697
476 115
2069 533
629 595
681 101
1489 562
1836 513
2206 115
2763 111
277 121
279 341
296 121
333 272
1870 435
2945 313
82 69
274 324
308 103
410 108
1034 103
1220 705
2666 1181
511 357
663 2427
1440 885
99 462
256 746
407 116
430 2114
2947 599
871 108
1987 1095
655 119
1819 329
3043 370
285 319
362 116
512 508
2107 1420
121 465
350 103
1374 121
2421 305
2951 1782
99 368
291 121
323 98
1233 312
296 1118
314 1166
427 1246
890 307
1302 400
73 73
98 552
509 53
720 2048
299 115
713 322
1825 432
50 55
257 316
259 121
269 3242
285 1259
333 2554
1363 815
3068 313
111 478
597 1032
632 2690
1164 115
119 494
295 121
503 263
304 1427
497 1943
759 2791
1939 435
669 52
924 2110
1517 1125
1927 802
363 340
105 283
105 367
269 97
295 264
101 406
266 110
269 1485
343 1727
381 112
418 54
691 959
1464 307
291 536
315 97
405 340
528 560
607 558
706 805
1786 463
411 1840
912 2574
1297 428
285 2332
316 277
269 2661
273 618
582 1418
783 101
2628 785
2695 2528
447 312
416 390
1586 805
109 283
273 284
349 873
371 625
509 51
876 276
1489 1110
116 592
280 1082
291 370
810 1527
1855 920
3029 2177
266 264
328 162
417 263
426 620
473 3437
644 116
2334 429
2455 121
2672 2005
314 960
427 565
921 313
1057 276
1940 276
80 293
378 1221
522 364
759 1313
845 115
68 65
301 556
1026 557
2551 429
259 461
1605 402
2152 334
87 344
628 317
1218 968
108 1849
258 306
318 2548
405 271
593 491
865 3220
1124 115
1924 560
2231 117
3278 376
509 48
532 2723
102 564
107 284
318 118
120 2566
284 117
349 445
362 595
379 481
387 115
393 919
680 100
2307 290
98 108
286 100
318 260
470 102
1666 276
2580 544
50 56
383 284
759 417
1525 2362
115 117
266 324
268 625
269 1840
274 384
360 265
497 2147
1311 3056
69 78
277 100
1045 276
106 908
708 290
1251 276
1381 425
2384 357
118 412
292 369
420 327
638 412
1036 2271
1117 2265
1294 284
1683 115
1765 274
2160 432
269 264
285 271
325 322
483 493
99 281
99 724
502 2833
1898 116
2226 116
111 111
1490 1884
1550 270
2263 370
325 281
330 322
989 3355
285 719
302 121
311 283
325 1021
405 773
584 101
768 406
288 370
325 316
325 428
2423 115
107 267
260 320
714 457
1041 265
1661 115
109 391
280 465
388 290
1033 324
983 101
1925 307
279 446
318 336
477 367
1257 102
2488 3334
285 1498
912 102
989 3065
1093 263
1307 288
927 546
938 546
1491 878
32 58
260 270
426 2098
549 2053
669 51
1936 552
256 377
266 397
362 3148
337 283
418 50
832 2218
1266 1482
283 471
295 1718
1352 284
2272 121
303 1849
349 273
378 409
418 56
630 2014
1355 299
105 321
1087 1139
97 322
487 2839
575 3059
780 1246
889 1340
913 101
1490 984
1991 270
98 281
295 491
1047 270
1048 98
1787 99
2204 105
72 69
280 1155
400 276
507 109
1602 121
1937 1027
277 276
285 1090
669 49
2214 602
3263 3517
194 176
293 341
312 2354
423 409
1447 386
2748 110
39 305
98 322
325 119
349 121
1131 1317
79 83
256 543
268 787
280 475
333 2903
1115 110
1631 101
1944 1944
2457 407
3398 121
329 267
810 1901
821 54
1357 896
2168 115
1357 102
1470 274
85 110
273 369
499 270
1113 284
2761 1856
265 259
274 543
688 1183
759 384
810 259
1144 114
1196 2720
1297 1259
1596 1050
46 124
315 342
349 363
439 1166
728 562
971 316
69 67
107 121
275 320
349 2731
574 292
1379 276
2970 559
308 2186
419 618
633 270
1075 284
85 83
298 601
379 482
416 598
1258 277
1262 412
1472 263
1976 1993
55 56
109 108
410 1040
933 1050
1582 98
291 3579
574 2234
999 2048
1723 809
108 412
338 263
360 2910
404 2534
408 276
679 276
46 59
114 329
464 1427
803 551
837 564
956 651
1214 659
1621 965
1860 305
3132 1336
266 384
616 776
1241 729
2224 3378
65 67
104 97
275 327
337 340
339 97
349 277
371 2826
473 982
512 448
65 796
279 598
289 3161
393 495
420 2099
424 1040
881 642
1108 482
1258 3626
1453 475
1681 115
2517 474
288 522
306 101
347 2396
1583 3558
1071 112
1333 3690
1416 1337
2080 284
3433 116
57 48
83 462
268 323
274 271
309 873
330 68
650 100
2979 364
401 2303
416 108
507 2119
954 115
2145 376
294 290
406 101
442 3684
538 376
593 1575
1011 302
1102 276
2944 307
98 260
114 586
275 782
279 3265
285 329
285 342
285 1633
337 2032
669 50
1314 276
1348 1110
1403 115
99 111
274 122
378 375
419 311
923 1807
1716 108
69 120
109 265
114 513
291 1153
69 68
109 267
301 3335
303 265
524 283
643 294
650 959
1595 2304
3165 302
330 302
420 320
748 458
894 2304
97 551
389 366
390 101
404 270
418 55
1085 657
1686 276
337 2618
349 1016
426 785
550 2182
584 391
610 3780
1781 284
65 77
273 313
659 107
2104 115
267 2879
413 100
1529 551
1740 317
273 495
447 121
728 367
1206 307
105 392
912 116
101 270
257 315
378 2913
476 312
691 98
1640 508
3091 471
277 284
360 277
360 1993
674 101
691 302
761 307
1422 104
1598 731
1967 345
2115 899
2688 429
2744 344
3590 435
269 651
349 719
927 2752
51 51
268 512
337 1512
646 276
803 365
1938 562
2268 872
2504 1665
353 302
380 1921
564 115
760 3349
772 112
1353 324
3909 65
99 435
282 3383
283 97
416 2223
794 2622
888 1575
1034 118
1469 277
80 104
121 1185
279 565
361 110
484 474
566 121
1739 384
2782 98
101 1159
117 478
267 369
303 1391
904 512
948 535
999 595
275 3637
871 2212
967 273
1437 288
1570 3215
1909 412
2133 263
3532 386
111 324
275 281
426 445
1923 284
2356 649
102 425
112 1277
371 323
404 471
561 855
864 2503
1694 115
2351 307
3074 121
3112 366
3151 611
262 2749
